<template>
  <uni-popup ref="privacyDialog">
    <view class="privacy-dialog">
      <view class="content">
        <view class="title"> 《个人信息保护政策》 </view>
        <view>
          {{
            companyInfo.companyName
          }}（下文简称为“我们”）非常重视用户的隐私和个人信息保护，致力于维持您对我们的信任。我们承诺采取相应的安全保护措施来保护您的个人信息。本政策适用于{{
            companyInfo.companyName
          }}基于会员权益相关产品所提供的服务，请您在使用我们产品服务前，仔细阅读并了解本《个人信息保护政策》。
          本个人信息保护政策与您所使用的我们的产品或服务密切相关，对于您行使个人权利及保护您的个人信息至关重要，请您在使用我们的产品或服务前务必认真阅读并充分理解本政策所写明的内容。阅读过程中，如您对我们的个人信息保护政策及服务条款的内容有任何疑问，请联系我们。一旦您开始使用我们的产品或服务，即表示您已经理解并同意本个人信息保护政策全部内容。若本个人信息保护政策有内容更新，我们会及时提示您更新的情况。
        </view>
        <view> 本政策适用于我们通过平台为您提供的上述产品和服务。 </view>
        <view> 最近更新日期：{{ companyInfo.updateDate }}。</view>
        <view> 如果您有任何疑问、意见或建议，请通过以下联系方式与我们联系： </view>
        <view> 电子邮件：{{ companyInfo.companyEmail }} </view>
        <view> 本政策将帮助您了解以下内容：</view>
        <view> 一、定义与解释 </view>
        <view> 二、我们如何收集和使用您的个人信息 </view>
        <view> 三、我们如何使用 Cookie 和同类技术 </view>
        <view> 四、我们如何委托处理、向第三方提供、转移、公开您的个人信息 </view>
        <view> 五、我们如何存储和保护您的个人信息 </view>
        <view> 六、您的权利 </view>
        <view> 七、我们如何处理敏感个人信息 </view>
        <view> 八、您的个人信息如何在全球范围转移 </view>
        <view> 九、本个人信息保护政策如何更新 </view>
        <view> 十、如何联系我们 </view>
        <view>
          我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守“合法、正当、必要和诚信原则”，严格遵守《中华人民共和国民法典》《中华人民共和国个人信息保护法》等适用法律有关个人信息保护的规定。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
        </view>
        <view>
          请在使用我们的产品（或服务）前，仔细阅读并了解本《个人信息保护政策》（以下简称“政策”），并确认了解我们对您个人信息的处理规则。一旦您点击确认接受我们的政策或在我们的政策更新后我们重新获得您的确认，即表示您认可并接受本政策（含更新版本）的所有内容，并同意我们按本政策收集、使用、保存、共享、转让或披露您的相关个人信息。
        </view>
        <view>
          一、定义与解释
          <view>1. 个人信息</view>
          <view
            >个人信息是以电子或者其他方式记录的与已识别或者可识别的自然人有关的各种信息，不包括匿名化处理后的信息。</view
          >

          <view>2. 敏感个人信息</view>
          <view
            >敏感个人信息是一旦泄露或者非法使用，容易导致自然人的人格尊严受到侵害或者人身、财产安全受到危害的个人信息，包括生物识别、宗教信仰、特定身份、医疗健康、金融账户、行踪轨迹等信息，以及不满十四周岁未成年人的个人信息。</view
          >

          <view>1. 个人信息</view>
          <view>1. 个人信息</view>

          <view>4. 去标识化</view>
          <view>去标识化指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。</view>
          <view> 5. 匿名化 </view>
          <view> 匿名化指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。 </view>
          <view> 6. 设备 </view>
          <view> 设备是指可用于访问我们服务的装置，例如台式计算机、笔记本电脑、平板电脑或智能手机。 </view>
          <view> 7. 唯一设备标识符 </view>
          <view>
            唯一设备标识符（专属 ID 或
            UUID）是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（移动设备的 IMEI 号）。
          </view>
          <view> 8. IP地址 </view>
          <view>
            每台上网的设备都会指定一个编号，称为互联网政策 (IP) 地址。这些编号通常都是根据地理区域指定的。IP
            地址通常可用于识别设备连接至互联网时所在的位置。
          </view>
          <view> 9. GPS </view>
          <view>
            Global Positioning
            System（全球定位系统）的简称。您使用的设备上的GPS信号接收器可以从GPS卫星收到信号并利用传来的信息计算您的位置。
          </view>
          <view> 10. WIFI </view>
          <view> Wi-Fi是一种允许电子设备连接到一个无线局域网（WLAN）的技术，通常我们所说的无线网络。 </view>
          <view> 11. 基站 </view>
          <view>
            基站，即公用移动通信基站，是无线电台站的一种形式，是指在一定的无线电覆盖区中，通过移动通信交换中心，与移动电话终端之间进行信息传递的无线电收发信电台。
          </view>
          <view> 12. SSL </view>
          <view>
            SSL（Secure Socket
            Layer）又称为安全套接层，是在传输通信政策（TCP/IP）上实现的一种安全政策。SSL支持各种类型的网络，同时提供三种基本的安全服务，均通过使用公开密钥和对称密钥技术以达到信息保密的效果。
          </view>
          <view> 13. 信息收集技术 </view>
          <view> 我们在本政策中所述的“自动收集”包括以下方式： </view>
          <view> （1）Cookie </view>
          <view>
            Cookie是您浏览网页时，网站服务器放在客户端（您的计算机、移动电话或其他智能终端内）里面的一个小小的文本文件，可用于改善您的使用体验。
          </view>
          <view> （2）Web beacon（网络信标） </view>
          <view>
            Web
            beacon是装嵌在网站或电邮内的电子图像文件案或其他技术，可用于计算访客数目、记录您是否及何时阅览电邮或网站，或用以使用某些Cookie。
          </view>
          <view> （3）Log files（日志文件） </view>
          <view>
            Log
            files储存自动收集的若干数据。该等数据包括互联网政策（IP）地址、浏览器类型、互联网服务提供商（ISP）、引用/退出页面、操作系统、日期/时间戳和点击流数据等。
          </view>
          <view> （4）ET Tag（实体标签） </view>
          <view>
            ET
            Tag是在互联网浏览器与互联网服务器之间背后传送的HTTP政策标头，可代替Cookie，用以追踪个别使用者，使我们可更深入地了解和改善我们的服务。
          </view>
          <view> （5）JavaScript </view>
          <view>
            JavaScript是一种编程语言，用于制作更具互动性和动态的网页。JavaScript可以设定Cookie、阅读Cookie及删除Cookie。
          </view>
          <view> 14.个人信息的处理 </view>
          <view> 个人信息的处理包括个人信息的收集、存储、使用、加工、传输、提供、公开、删除等。 </view>
          <view> 二、我们如何收集和使用您的个人信息 </view>
          <view> 我们根据合法、正当、必要的原则，出于如下所述的目的收集和使用您的个人信息。 </view>
          <view> 1.您选择使用我们的产品和服务，需要向我们提供或允许我们收集并使用的必要信息包括： </view>
          <view>
            （1）基于我们提供的产品和/或服务的地域性特征，在您点击进入我们的产品销售页面时，我们会从微信（如您通过公众号进入我们的产品销售页面）间接或直接（如您通过网页直接进入我们的产品销售页面）获取您的地理位置，该等地理位置系基于您使用的IP地址获得的非精确（仅可到城市级别）的地理位置信息，以便于我们更好地向您展示与您所在城市匹配的产品和/或服务；
          </view>
          <view>
            （2）您在购买我们平台提供的产品和/或服务、提交您的服务需求时，我们需要收集您的姓名、电话号码、身份证号码，并将其提供给您所购买的产品和/或服务的运营商（以您提交服务需求时页面标注的运营商为准），便于其对您进行身份核验和进行产品和/或服务的开通、办理业务。
          </view>
          <view>
            （3）为了便于运营商向您寄送相关产品和/或服务，我们需要收集您的电话号码、收件地址和收件人信息，并将其提供给您所购买的产品和/或服务的运营商，便于其为您提供产品和/或服务的寄送服务。
          </view>
          <view>
            （4）我们会在您提交产品和/服务购买订单后，我们会收集您在使用我们的产品或服务过程中所产生的订单信息，具体包括:订单编号、订单来源、商品名称、下单时间、用户ID、订单价格、实际支付价格、支付方式，如您选购的商品涉及邮寄服务，我们还将收集您填写的收货信息，包括收货人、联系电话、收货地址等。此外，我们亦将从运营商处收集对应的订单所涉商品和/或服务的物流信息和开通/使用状态。我们将使用该等订单信息为您提供订单信息展示和查询服务，为您跟进处理存在异常的订单，并对您进行必要的客户回访。
          </view>
          <view> （5）为了保障系统安全，确保我们可以与您进行有效的互联网通信，我们将会收集您的如下信息： </view>
          <view>
            a.日志信息：当您使用我们的网站或客户端提供的产品或服务时，我们可能会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。包括您的IP地址、浏览器的类型、电信运营商、网络环境、使用的语言、访问日期和时间及您访问的网页操作记录、Push打开记录、停留时长、刷新记录。
          </view>
          <view>
            b.设备信息：我们会根据您在产品使用过程中授予的具体权限，接收并记录您所使用的设备相关信息（例如浏览器及版本、操作系统及版本、设备分辨率信息）、设备所在位置相关信息（IP
            地址）。
          </view>
          <view>
            请注意，单独的设备信息、日志信息是无法识别特定自然人身份的信息。如果我们将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，该个人信息我们将依法依规进行处理并取得您的同意。
          </view>
          <view>
            （6）我们会根据您的订单信息、您的日志信息、设备信息，使用您提供的您的联系电话与您取得联系，向您推荐与您匹配的相关运营商商品和/或服务。您授权同意我们及关联方、业务合作方向你一次或多次进行产品或者服务及产品的宣传及资讯信息触达，产品及资讯内容包括但不限于：电信相关服务、保险、银行、教育及其他方面的商业广告、资讯信息。触达方式包括短信、电话或邮件等。如果您拒绝我们的该等推荐服务的，可以通过回复拒绝短信（拒绝方式以短信内容提示为准）或电话口头告知的方式予以拒绝；您拒绝我们的该等服务后，我们不会再使用您的个人信息向您推荐与您匹配的相关运营商商品和/或服务。
          </view>
          <view>
            （7）通过使用您同意我们收集的个人信息（注册信息、网页浏览信息、我们自行合法采集的个人信息），我们得以向您提供其它的商业营销内容，您知悉这是我们面向用户提供的主要服务。您同意我们向您展现或触达我们的商业合作伙伴提供的产品及服务的信息流或者广告/推广信息。具体我们可能会通过短信、电话或其它方式向您提供您可能感兴趣的商业广告、商业活动等商业性信息。例如，我们可能会基于您的偏好特征向您触达培训、教育、保险、金融理财、电商等领域的产品或服务的商业信息。我们会严格保护您的个人信息，不会超出法律法规和本政策的内容将您的个人信息提供给第三方。如您不想接收我们给您发送的商业营销信息，您可以根据营销短信的内容提示或者本政策第六条公示的方式及第十一条公示的联系方式进行退订、撤回同意等，来停止接受我们提供的服务。除上述基础业务使用目的外，作为助力品牌方运营营销、为用户提供丰富个性化优质产品服务，致力于让“推广-触达”更便捷的综合资讯营销推广服务平台，我们可为您提供我们合作方、关联方提供的多行业、多领域的产品或服务的商业广告、资讯信息。如果您选择同意当前营销页面中的单独同意书，结合收集到的其它个人信息，我们可以为您提供以上附加业务。
          </view>
          <view>
            （8）我们会收集您通过我们的客服或参加我们举办的活动时所提交的个人信息，以为您提供您所要求的客户服务或对应的优惠活动服务。
          </view>
          <view> （9）我们会收集您通过其他方式向我们所提交的个人信息，用于您提交该等个人信息时申明的目的和用途。 </view>
          <view>
            2.我们收集上述必要个人信息及经您同意后向我们提供或允许我们收集的非必要个人信息，还将用于以下用途：
          </view>
          <view> （1）对您的个人信息在内的用户数据库进行统计分析，以供我们内部经营决策使用。 </view>
          <view> （2）持续开发和优化产品服务 </view>
          <view>
            我们使用收集到的个人信息保障我们及关联方、合作方的业务运营，例如评估、维护和改进产品和服务的性能，当我们的系统发生故障时，我们会记录和分析系统故障时产生的信息，优化我们的相关服务。
          </view>
          <view>
            为迭代和开发新的产品和服务，我们可能对收集的个人信息加以统计分析辅助决策，并将数据分析结果提供给第三方，但请您放心，该等数据分析结果不包含您的任何个人信息。
          </view>
          <view> 4. 事先征得授权同意的例外 </view>
          <view> 根据相关法律法规及国家标准，在以下情形中，我们会依法收集并使用您的个人信息无需征得您的同意： </view>
          <view> -为订立、履行您作为一方当事人的合同所必需； </view>
          <view> - 为履行法定职责或者法定义务所必需； </view>
          <view> - 为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需； </view>
          <view> - 为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息； </view>
          <view> - 依照法律规定在合理的范围内处理您自行公开或者其他已经合法公开的您的个人信息； </view>
          <view> - 法律、行政法规规定的其他情形。 </view>
          <view> 5. 补充说明 </view>
          <view> 当我们要将信息用于本政策未载明的其它用途时，会事先征求您的同意。 </view>
          <view> 三、我们如何使用Cookie、同类技术 </view>
          <view> 1. cookie </view>
          <view>
            为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie
            通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好或购物篮内的商品等数据。
          </view>
          <view>
            我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
            Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie
            的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
          </view>
          <view> 2. 网站信标和像素标签 </view>
          <view>
            除 Cookie
            外，我们还可能会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击
            URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
          </view>
          <view> 3. Do Not Track（请勿追踪） </view>
          <view>
            很多网络浏览器均设有 Do Not Track 功能，该功能可向网站发布 Do Not Track
            请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了 Do Not
            Track，那么我们的所有网站都会尊重您的选择。
          </view>
          <view> 四、我们如何委托处理、向第三方提供、转移、公开您的个人信息 </view>
          <view> 1.委托处理 </view>
          <view>
            我们的一些业务功能和技术服务可能由外部供应商提供。我们委托处理个人信息的，会与受托人明确约定委托处理的目的、期限、处理方式、个人信息的种类、保护措施以及双方的权利和义务等，并对受托人的个人信息处理活动进行监督。
          </view>
          <view>
            我们会严格要求受托人按照约定处理个人信息，不得超出约定的处理目的、处理方式等处理个人信息；如发生委托合同不生效、无效、被撤销或者终止等情形，我们将要求受托人将个人信息返还或者予以删除，不得保留。
          </view>
          <view> 2.向第三方提供 </view>
          <view> 我们不会向本公司以外的任何公司、组织和个人提供您的个人信息，除非获得您的明确同意。 </view>
          <view>
            目前为了向您提供我们的服务，我们需向合作运营商分享您的个人信息，以实现向您提供您需要的服务，包括：
          </view>
          <view> -将您的身份信息提供给运营商，以便其对您进行身份验证、履行“电信服务实名制”的法定要求； </view>
          <view> -将您的收件地址、电话号码和收件人提供给运营商，以便于其对您寄送您购买的产品和/或服务。 </view>
          <view> 相关运营商的联系方式和隐私政策请见“单独同意书”。 </view>
          <view>
            请您知悉，我们可能会将你的个人信息传输给关联方或合作方（包括但不限于提供产品或服务的提供方、相关技术服务商、信息服务商、邮寄公司、提供奖品公司或其他业务合作方），由关联方或合作方向你提供具体的产品或服务。请您放心，就前述合作中所涉信息对外提供上，我们会采用去标识化、匿名化或加密算法等技术措施对数据进行处理，确保合作方无法直接识别到您的身份；
          </view>
          <view> 3.转移 </view>
          <view>
            因合并、分立、解散、被宣告破产、业务/资产出售等原因需要转让个人信息的，我们会向您告知接收方的名称或者姓名和联系方式。我们会要求接收方继续受本政策的约束，否则我们将要求接收方重新取得您个人的同意。
          </view>
          <view> 4.公开 </view>
          <view> 我们不会公开我们处理的您的个人信息，除非取得您的单独同意。 </view>
          <view> 5.向第三方提供、公开个人信息时事先征得授权同意的例外 </view>
          <view> 以下情形中，向第三方提供、公开您的个人信息无需事先征得您的同意： </view>
          <view> - 为订立、履行您作为一方当事人的合同所必需；； </view>
          <view> - 为履行法定职责或者法定义务所必需； </view>
          <view> - 为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需； </view>
          <view> - 为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息； </view>
          <view> - 依照法律规定在合理的范围内处理您自行公开或者其他已经合法公开的您的个人信息； </view>
          <view> - 法律、行政法规规定的其他情形。 </view>
          <view>
            我们会在合理的范围内处理您自行公开或者其他已经合法公开的个人信息，您明确拒绝的除外。我们处理上述已公开的个人信息，对于可能对您个人权益产生重大影响的，我们会依照法律规定取得您个人的同意。
          </view>
          <view> 五、我们如何存储和保护您的个人信息 </view>
          <view> 1. 我们如何存储信息 </view>
          <view> 1）存储信息的地点 </view>
          <view>
            我们遵守法律法规的规定，收集的有关您的信息和资料将保存在中华人民共和国境内我们的服务器上。以下情形除外：
          </view>
          <view> - 法律法规有明确规定； </view>
          <view> - 获得您的明确授权； </view>
          <view> - 您通过互联网进行跨境交易等个人主动行为。 </view>
          <view> 2）存储信息的期限 </view>
          <view>
            您同意并授权：就您每次通过平台购买产品和/或服务提交及产生的个人信息，我们对其的保存期限为3年，并在保存期限内按照本政策的规定进行处理。但法律法规对我们收集的您的个人信息的保存期限另有规定的除外。
          </view>
          <view>
            如在前述存储期限内我们的相关服务发生停止运营的情形时，我们将采取包括推送通知和公告形式在内的通知您，并在合理的期限内删除服务器中留存的您的个人信息或进行匿名化处理。
          </view>
          <view> 2. 我们如何保护您的个人信息 </view>
          <view>
            （1）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。例如，在您的浏览器与“服务”之间交换数据（如身份证信息）时受
            SSL 加密保护；我们同时对我们网站提供 https
            安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问个人信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
          </view>
          <view>
            （2）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
          </view>
          <view>
            （3）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他我们用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
          </view>
          <view>
            （4）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将依法承担相应的法律责任。
          </view>
          <view>
            （5）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话或推送通知等任一可行的方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
          </view>
          <view> 同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。 </view>
          <view> 六、您的权利 </view>
          <view>
            按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利，您可以参考下面的步骤进行相关操作：
          </view>
          <view> 1.撤回同意的权利 </view>
          <view>
            鉴于我们是基于您的同意处理您的个人信息，您可以通过我们的在线客服或拨打客服电话联系我们，撤回您的同意，我们将在15个工作日内响应您的需求。
          </view>
          <view>
            请您知悉，我们提供的产品和服务需要一些必要的个人信息才能得以完成（见本政策“第二部分”），对于此类必要信息，如您撤回您的同意，我们将无法为您提供我们的产品或服务；对于额外收集的个人信息的收集和使用，您有权随时向我们撤回您的同意。
          </view>
          <view>
            在我们依照您的要求处理您的撤回同意请求后，我们将不再处理您撤回同意所涉及的个人信息，同时我们也将无法为您提供对应的或全部的服务。但您的撤回同意，不影响撤回前基于您的同意已进行的个人信息处理活动的效力。
          </view>
          <view> 2. 查阅、复制您的个人信息 </view>
          <view>
            您有权查阅、复制您的个人信息，法律法规规定的例外情况除外。如果您想行使数据查阅权、复制权，可以随时通过我们的在线客服或拨打客服电话与我们联系。我们将在15个工作日内回复您。
          </view>
          <view> 3. 转移个人信息 </view>
          <view>
            您请求将您的个人信息转移至您指定的个人信息处理者的，如果符合国家网信部门规定条件的，我们会提供转移的途径。如果您想行使前述权利，可以随时通过我们的在线客服或拨打客服电话与我们联系，我们将在15个工作日内回复您。
          </view>
          <view> 4.更正、补充您的个人信息 </view>
          <view>
            当您发现我们处理的关于您的个人信息有错误或需要补充时，您有权要求我们做出更正、补充。您可以通过发送电子邮件【{{
              companyInfo.companyEmail
            }}】联系我们。我们将在15个工作日内对您的个人信息予以核实，并及时更正、补充。
          </view>
          <view> 5.删除您的个人信息 </view>
          <view> 在以下情形中，我们会主动删除且您有权要求我们删除您的个人信息： </view>
          <view> （1）我们的处理目的已实现、无法实现或者为实现处理目的不再必要； </view>
          <view> （2）我们停止提供产品或者服务，或者保存期限已届满； </view>
          <view> （3）您撤回同意； </view>
          <view> （4）我们违反法律、行政法规或者违反约定处理个人信息； </view>
          <view> （5）法律、行政法规规定的其他情形。 </view>
          <view>
            如果删除个人信息从技术上难以实现的，我们会停止除存储和采取必要的安全保护措施之外的个人信息处理活动。
          </view>
          <view> 6. 您行使权利的指引 </view>
          <view>
            为保障安全，在行使权利时您可能需要向我们书面提出，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
          </view>
          <view> 我们将在15个工作日内做出答复。如您不满意，还可以通过以下途径投诉： </view>
          <view> 拨打客服电话：【{{ serviceNumber }}】 </view>
          <view> 七、第三方网站和服务 </view>
          <view>
            我们的政策不适用于第三方提供的产品或服务。您使用我们的产品或服务可能包括第三方的产品或服务，其中一些会以第三方网站的链接形式提供，还有一些会以SDK、API等形式接入。当您使用这些产品或服务时，也可能收集您的信息。因此，我们强烈建议您花时间阅读该第三方的个人信息保护政策，就像阅读我们的政策一样。我们不对第三方如何使用他们向您收集的个人信息负责，也不能控制其使用。我们的个人信息保护政策不适用通过我们的服务链接的其他网站。
          </view>
          <view> 八、我们如何处理敏感个人信息 </view>
          <view>
            1．只有在具有特定的目的和充分的必要性，并采取严格保护措施的情形下，我们才会处理您的敏感个人信息。
          </view>
          <view>
            2．处理您的敏感个人信息我们会取得您的单独同意；法律、行政法规规定处理敏感个人信息应当取得您的书面同意的，我们会取得您的单独书面同意。
          </view>
          <view>
            3．我们处理您的敏感个人信息的，会向您告知处理敏感个人信息的必要性以及对您个人权益的影响，除非法律另有规定。
          </view>
          <view> 4．我们如何处理儿童的个人信息 </view>
          <view> （1）尽管各地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。 </view>
          <view>
            （2）我们不为14周岁以下（含）的儿童提供平台相关的产品和/服务。如您未满14周岁，请停止使用我们的平台产品和/或服务。
          </view>
          <view>
            （3）通常而言，在未取得监护人同意的情况下，我们不会主动收集或处理儿童个人信息。然而，由于技术上的限制，在某些场景下，特别是提供线上服务时，我们无法识别用户的年龄。在这种情况下，用户将被我们视为有完整且合法的权利将其个人信息根据相关法律提供给我们。如果我们在无法识别用户年龄的情况下，未经监护人的许可收集了儿童个人信息，请监护人及时通知我们，我们在获悉该等情况后将会及时删除此类信息。如您对您所监护的儿童的个人信息有疑问，请通过本政策第十一条所述联系方式与我们联系。
          </view>
          <view> 九、您的个人信息如何在全球范围转移 </view>
          <view> 只有在完全符合我国法律规定的前提下，我们才会将您的个人信息跨境提供。 </view>
          <view> 十、本个人信息保护政策如何更新 </view>
          <view> 我们的个人信息保护政策可能变更。 </view>
          <view>
            1.
            未经您明确同意，我们不会削减您按照本政策所应享有的权利。我们会在专门页面上发布对政策所做的任何变更并重新征得您的同意。
          </view>
          <view>
            2. 对于重大变更，我们还会提供更为显著的通知，包括我们会通过网站公示的方式进行通知甚至向您提供弹窗提示。
          </view>
          <view> 本政策所指的重大变更包括但不限于： </view>
          <view> - 我们处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等发生变化； </view>
          <view> - 个人信息共享、转让或公开披露的主要对象发生变化； </view>
          <view> - 您参与个人信息处理方面的权利及其行使方式发生重大变化； </view>
          <view> -我们的名称、联系方式发生了变化。 </view>
          <view> 十一、如何联系我们 </view>
          <view>
            如您在使用我们的产品或服务的过程中对本个人信息保护政策有任何疑问或建议，请通过以下联系方式与我们联系：
          </view>
          <view> 公司名称：{{ companyInfo.companyName }} </view>
          <view> 地 址：{{ companyInfo.companyAddress }} </view>
          <!-- <view> 网络安全负责人：刘涛 </view> -->
          <view> 电子邮件：{{ companyInfo.companyEmail }} </view>
          <view>
            为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份后处理您的请求。一般情况下，我们将在三十天内回复。
          </view>
          <view>
            如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过以下外部途径寻求解决方案：向【{{
              companyInfo.companyName
            }}住所地有管辖权的法院提起诉讼】。
          </view>
        </view>
      </view>

      <view class="close">
        <uni-icons color="#666666" type="closeempty" size="20" @click="$refs.privacyDialog.close()" />
      </view>
    </view>
  </uni-popup>
</template>

<script>
export default {
  name: 'privacyPage',

  props: ['companyInfo', 'serviceNumber'],

  data() {
    return {
    };
  },

  methods: {
    /**
     * 开启弹窗显示
     */
    open() {
      this.$refs.privacyDialog.open();
    },

    /**
     * 关闭弹窗显示
     */
    close() {
      this.$refs.privacyDialog.close();
    },
  },
};
</script>

<style lang="scss">
.privacy-dialog {
  .content {
    width: 590rpx;
    background: #ffffff;
    border-radius: 20rpx;
    padding: 40rpx;
    font-size: 24rpx;
    color: #333333;
    max-height: 80vh;
    overflow: auto;
    line-height: 1.8;

    .title {
      text-align: center;
      font-size: 32rpx;
      font-weight: bold;
      margin-bottom: 10rpx;
    }
  }

  .close {
    position: absolute;
    top: 5rpx;
    right: 10rpx;
  }
}
</style>
